## Staging: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-waf-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-waf-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "aws-waf-logs-notification-canada-ca-waf"
      + retention_in_days = 7
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # aws_wafv2_regex_pattern_set.re_no_api_nor_domain will be created
  + resource "aws_wafv2_regex_pattern_set" "re_no_api_nor_domain" {
      + arn         = (known after apply)
      + description = "Regex discarding invalid API endpoints"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "re_no_api"
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }

      + regular_expression {
          + regex_string = "^(?!api).*$"
        }
      + regular_expression {
          + regex_string = "^(?!staging.notification.cdssandbox.xyz).*$"
        }
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id         = "d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
        name       = "notification-canada-ca-waf"
        tags       = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)


      + rule {
          + name     = "api_invalid_path"
          + priority = 11

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {

              + regex_pattern_set_reference_statement {
                  + arn = (known after apply)

                  + field_to_match {

                      + single_header {
                          + name = "Host"
                        }
                    }

                  + text_transformation {
                      + priority = 1
                      + type     = "COMPRESS_WHITE_SPACE"
                    }
                  + text_transformation {
                      + priority = 2
                      + type     = "LOWERCASE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "api_invalid_path"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "document_download_invalid_path"
          + priority = 10

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {
              + and_statement {
                  + statement {

                      + byte_match_statement {
                          + positional_constraint = "STARTS_WITH"
                          + search_string         = "api.document"

                          + field_to_match {

                              + single_header {
                                  + name = "Host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + regex_pattern_set_reference_statement {
                                  + arn = "arn:aws:wafv2:ca-central-1:239043911459:regional/regexpatternset/re_document_download/16c61e77-fe42-4f0c-a46b-b896430771f5"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "document_download_api_invalid_path"
              + sampled_requests_enabled   = true
            }
        }

        # (7 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.notification-canada-ca-waf-logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "notification-canada-ca-waf-logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:239043911459:regional/webacl/notification-canada-ca-waf/d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>